Tekla Open API Reference for Tekla Structures 2025
MultiDrawing Properties
The MultiDrawing type exposes the following members.
Properties
Name | Description
CommitMessage
 Gets the commit message
 (Inherited from Drawing.)
CreationDate
 The drawing creation date.
 (Inherited from Drawing.)
DrawingTypeStr
 The type of the drawing
 (Inherited from Drawing.)
IsFrozen
 Describes whether the drawing is frozen.
 (Inherited from Drawing.)
IsIssued
 Describes whether the drawing is issued.
 (Inherited from Drawing.)
IsIssuedButModified
 Describes whether the drawing is issued but modified since it was issued.
 (Inherited from Drawing.)
IsLocked
 Describes whether the drawing is locked.
 (Inherited from Drawing.)
IsLockedBy
 Gets the logged in username that set the drawing to locked
 (Inherited from Drawing.)
IsMasterDrawing
 Describes whether the drawing is a master drawing (shown with a special symbol on the drawing list).
 (Inherited from Drawing.)
IsReadyForIssue
 Describes whether the drawing is ready for issue.
 (Inherited from Drawing.)
IsReadyForIssueBy
 Gets the logged in username that set the drawing Ready for issue
 (Inherited from Drawing.)
IssuingDate
 The drawing issuing date.
 (Inherited from Drawing.)
Layout
 Gets the drawing layout attributes.
 (Inherited from Drawing.)
Mark
 The drawing mark.
 (Inherited from Drawing.)
ModificationDate
 The drawing modification date.
 (Inherited from Drawing.)
Name
 The name of the drawing.
 (Inherited from Drawing.)
OutputDate
 The drawing output date. XS_DISABLE_DRAWING_PLOT_DATE controls whether this date is set.
 (Inherited from Drawing.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
SectionViewStartLabel
 Gets the drawing attribute for start label of section view
 (Inherited from Drawing.)
Title1
 The first drawing title.
 (Inherited from Drawing.)
Title2
 The second drawing title.
 (Inherited from Drawing.)
Title3
 The third drawing title.
 (Inherited from Drawing.)
UpToDateStatus
 Gets the drawing up to date status.
 (Inherited from Drawing.)
Top
See Also
Reference
MultiDrawing Class
Tekla.Structures.Drawing Namespace